### <font color="Blue">CAPSTONE PROJECT :</font> <font color="orange"> MARKET AND RETAIL ANALYSIS </font> ###

#### <font color="red">Preparing and Cleaning</font> <font color="green">Retail_Dataset.xlsx</font>

In [1]:
# Importing the required libraries

import numpy as np
import pandas as pd

# Filtering out the warnings

import warnings
warnings.filterwarnings("ignore")

#### <font color="blue">**READING**</font> **Retail Dataset** Sheet by Sheet

###  *Orders Sheet*

In [2]:
# Reading Orders Sheet

orders_data = pd.read_excel("Retail_dataset.xlsx", sheet_name="orders")
orders_data.head()

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_timestamp,order_estimated_delivery_date
0,e481f51cbdc54678b7cc49136f2d6af7,7c396fd4830fd04220f754e42b4e5bff,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-10 21:25:13,2017-10-18
1,53cdb2fc8bc7dce0b6741e2150273451,af07308b275d755c9edb36a90c618231,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-08-07 15:27:45,2018-08-13
2,47770eb9100c2d0c44946d9cf07ec65d,3a653a41f6f9fc3d2a113cf8398680e8,delivered,2018-08-08 08:38:49,2018-08-08 08:55:23,2018-08-17 18:06:29,2018-09-04
3,949d5b44dbf5de918fe9c16f97b45f8a,7c142cf63193a1473d2e66489a9ae977,delivered,2017-11-18 19:28:06,2017-11-18 19:45:59,2017-12-02 00:28:42,2017-12-15
4,ad21c59c0840e6cb83a9ceb5573f8159,72632f0f9dd73dfee390c9b22eb56dd6,delivered,2018-02-13 21:18:39,2018-02-13 22:20:29,2018-02-16 18:17:02,2018-02-26

In [3]:
# Checking Shape of Orders Sheet

orders_data.shape

(99441, 7)

In [4]:
# Checking info of orders Dataset

orders_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 7 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   order_id                       99441 non-null  object
 1   customer_id                    99441 non-null  object
 2   order_status                   99441 non-null  object
 3   order_purchase_timestamp       99441 non-null  datetime64[ns]
 4   order_approved_at              99281 non-null  datetime64[ns]
 5   order_delivered_timestamp      96476 non-null  datetime64[ns]
 6   order_estimated_delivery_date  99441 non-null  datetime64[ns]
dtypes: datetime64[ns](4), object(3)
memory usage: 5.3+ MB

In [5]:
# Checking count of duplicate entries in Orders Sheet on order_id

orders_data.order_id.duplicated().sum()

0

In [6]:
# Checking NULL values in orders data

orders_data.isna().sum()

order_id                            0
customer_id                         0
order_status                        0
order_purchase_timestamp            0
order_approved_at                 160
order_delivered_timestamp        2965
order_estimated_delivery_date       0
dtype: int64

In [7]:
# Checking order status 

orders_data.order_status.value_counts()

delivered      96478
shipped         1107
canceled         625
unavailable      609
invoiced         314
processing       301
created            5
approved           2
Name: order_status, dtype: int64

In [8]:
# As we have to considered only Delivered data, so we save Delivered data only.

orders_data = orders_data[orders_data.order_status == 'delivered']
orders_data.head()

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_timestamp,order_estimated_delivery_date
0,e481f51cbdc54678b7cc49136f2d6af7,7c396fd4830fd04220f754e42b4e5bff,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-10 21:25:13,2017-10-18
1,53cdb2fc8bc7dce0b6741e2150273451,af07308b275d755c9edb36a90c618231,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-08-07 15:27:45,2018-08-13
2,47770eb9100c2d0c44946d9cf07ec65d,3a653a41f6f9fc3d2a113cf8398680e8,delivered,2018-08-08 08:38:49,2018-08-08 08:55:23,2018-08-17 18:06:29,2018-09-04
3,949d5b44dbf5de918fe9c16f97b45f8a,7c142cf63193a1473d2e66489a9ae977,delivered,2017-11-18 19:28:06,2017-11-18 19:45:59,2017-12-02 00:28:42,2017-12-15
4,ad21c59c0840e6cb83a9ceb5573f8159,72632f0f9dd73dfee390c9b22eb56dd6,delivered,2018-02-13 21:18:39,2018-02-13 22:20:29,2018-02-16 18:17:02,2018-02-26

In [9]:
# Checking total entries in new delivery dataset

orders_data.order_status.value_counts()

delivered    96478
Name: order_status, dtype: int64

In [10]:
# Checking Null values in Delivery dataset

orders_data.isna().sum().sort_values(ascending=False)

order_approved_at                14
order_delivered_timestamp         8
order_estimated_delivery_date     0
order_purchase_timestamp          0
order_status                      0
customer_id                       0
order_id                          0
dtype: int64

In [11]:
# Handling Null values 
## Handing Approved_at Null value by Purchase timestamp
orders_data.order_approved_at.fillna(orders_data.order_purchase_timestamp, inplace=True)
## Handing Delivery_timestamp Null values by estimated_delivery_date
orders_data.order_delivered_timestamp.fillna(orders_data.order_estimated_delivery_date, inplace=True)

In [12]:
#Checking again for Null Value after Handling Null Values

orders_data.isna().sum().sort_values(ascending=False)

order_estimated_delivery_date    0
order_delivered_timestamp        0
order_approved_at                0
order_purchase_timestamp         0
order_status                     0
customer_id                      0
order_id                         0
dtype: int64

###  *order_item Sheet*

In [13]:
# Reading Order_item Sheet

order_items_data = pd.read_excel("Retail_dataset.xlsx", sheet_name="order_items")
order_items_data.head()

,order_id,order_item_id,product_id,seller_id,price,shipping_charges
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,58.90,13.29
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,239.90,19.93
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,199.00,17.87
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,12.99,12.79
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,199.90,18.14

In [14]:
# Checking Shape of Order_item Sheet

order_items_data.shape

(112650, 6)

In [15]:
# Checking info of Order_item Dataset

order_items_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 112650 entries, 0 to 112649
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   order_id          112650 non-null  object
 1   order_item_id     112650 non-null  int64
 2   product_id        112650 non-null  object
 3   seller_id         112650 non-null  object
 4   price             112650 non-null  float64
 5   shipping_charges  112650 non-null  float64
dtypes: float64(2), int64(1), object(3)
memory usage: 5.2+ MB

In [16]:
# Checking Null values in Order_item dataset

order_items_data.isna().sum().sort_values(ascending=False)

shipping_charges    0
price               0
seller_id           0
product_id          0
order_item_id       0
order_id            0
dtype: int64

###  *customers Sheet*

In [17]:
# Reading customers Sheet

customers_data = pd.read_excel("Retail_dataset.xlsx", sheet_name="customers")
customers_data.head()

,customer_id,customer_zip_code_prefix,customer_city,customer_state
0,861eff4711a542e4b93843c6dd7febb0,14409,franca,SP
1,290c77bc529b7ac935b93aa66c333dc3,9790,sao bernardo do campo,SP
2,060e732b5b29e8181a18229c7b0b2b5e,1151,sao paulo,SP
3,259dac757896d24d7702b9acbbff3f3c,8775,mogi das cruzes,SP
4,345ecd01c38d18a9036ed96c73b8d066,13056,campinas,SP

In [18]:
# Checking Shape of customers Sheet

customers_data.shape

(99441, 4)

In [19]:
# Checking info of customers Dataset

customers_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 4 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   customer_id               99441 non-null  object
 1   customer_zip_code_prefix  99441 non-null  int64
 2   customer_city             99441 non-null  object
 3   customer_state            99441 non-null  object
dtypes: int64(1), object(3)
memory usage: 3.0+ MB

In [20]:
# Checking Null values in customers dataset

customers_data.isna().sum().sort_values(ascending=False)

customer_state              0
customer_city               0
customer_zip_code_prefix    0
customer_id                 0
dtype: int64

In [21]:
# Checking count of duplicate entries in Customer Sheet on customer_id

customers_data.customer_id.duplicated().sum()

3345

In [22]:
# Confirming Count of Duplicate Entries in customer sheet on customer_id
customers_data[customers_data.customer_id.duplicated()]

,customer_id,customer_zip_code_prefix,customer_city,customer_state
679,b6c083700ca8c135ba9f0f132930d4e8,8686,suzano,SP
1463,a40096fc0a3862e9e12bc55b5f8e6ab2,20561,rio de janeiro,RJ
1607,b8b3c435a58aebd788a477bed8342910,95585,arroio do sal,RS
2811,66980c3775537536f77b434d74e520f5,30290,belo horizonte,MG
3198,788313d21c3507fe890921f6e17aa679,11070,santos,SP
...,...,...,...,...
99324,8bab3162259edfaadd1ea2e1fe7f58dc,31565,belo horizonte,MG
99327,12ab9334b1240d6d037f2b0102a49571,38050,uberaba,MG
99336,0ee57f62666561b72f2ceacad0230cbf,9530,sao caetano do sul,SP
99353,0ceb502fc33a2ad327b08288c5310e2e,29134,viana,ES
99406,5cbfdb85ec130898108b32c50d619c39,74980,aparecida de goiania,GO

In [23]:
# Dropping Duplicate Data in Customer data using customer Id as customer id should be unique not duplicated

customers_data.drop_duplicates(subset='customer_id', keep='first')

,customer_id,customer_zip_code_prefix,customer_city,customer_state
0,861eff4711a542e4b93843c6dd7febb0,14409,franca,SP
1,290c77bc529b7ac935b93aa66c333dc3,9790,sao bernardo do campo,SP
2,060e732b5b29e8181a18229c7b0b2b5e,1151,sao paulo,SP
3,259dac757896d24d7702b9acbbff3f3c,8775,mogi das cruzes,SP
4,345ecd01c38d18a9036ed96c73b8d066,13056,campinas,SP
...,...,...,...,...
99436,1a29b476fee25c95fbafc67c5ac95cf8,3937,sao paulo,SP
99437,d52a67c98be1cf6a5c84435bd38d095d,6764,taboao da serra,SP
99438,e9f50caf99f032f0bf3c55141f019d99,60115,fortaleza,CE
99439,73c2643a0a458b49f58cea58833b192e,92120,canoas,RS
99440,84732c5050c01db9b23e19ba39899398,6703,cotia,SP

In [24]:
# Confirming & Checking Duplicate Data in Customer data using customer Id as customer id should be unique not duplicated

customers_data.drop_duplicates(subset='customer_id', keep='first').shape

(96096, 4)

In [25]:
# Final Saving customer data after dropping duplicate data & checking count

customers_data.drop_duplicates(subset='customer_id', keep='first', inplace=True)
customers_data.shape

(96096, 4)

In [26]:
# Checking again for Duplicate Values on customer_id

customers_data.customer_id.duplicated().sum()

0

###  *payments Sheet*

In [27]:
# Reading payments Sheet

payments_data = pd.read_excel("Retail_dataset.xlsx", sheet_name="payments")
payments_data.head()

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99.33
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24.39
2,25e8ea4e93396b6fa0d3dd708e76c1bd,1,credit_card,1,65.71
3,ba78997921bbcdc1373bb41e913ab953,1,credit_card,8,107.78
4,42fdf880ba16b47b59251dd489d4441a,1,credit_card,2,128.45

In [28]:
# Checking Shape of payments Sheet

payments_data.shape

(103886, 5)

In [29]:
# Checking info of payments Dataset

payments_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103886 entries, 0 to 103885
Data columns (total 5 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   order_id              103886 non-null  object
 1   payment_sequential    103886 non-null  int64
 2   payment_type          103886 non-null  object
 3   payment_installments  103886 non-null  int64
 4   payment_value         103886 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 4.0+ MB

In [30]:
# Checking Null values in payments dataset

payments_data.isna().sum().sort_values(ascending=False)

payment_value           0
payment_installments    0
payment_type            0
payment_sequential      0
order_id                0
dtype: int64

In [31]:
# Checking count of duplicate entries in Payment Sheet on order_id

payments_data.order_id.duplicated().sum()

4446

In [32]:
# Confirming Count of Duplicate Entries in Payment Sheet on order_id

payments_data[payments_data.order_id.duplicated()]

,order_id,payment_sequential,payment_type,payment_installments,payment_value
1456,683bf306149bb869980b68d48a1bd6ab,1,credit_card,1,8.58
2324,e6a66a8350bb88497954d37688ab123e,2,voucher,1,10.51
2393,8e5148bee82a7e42c5f9ba76161dc51a,1,credit_card,1,0.67
2414,816ccd9d21435796e8ffa9802b2a782f,1,credit_card,1,5.65
2497,2cbcb371aee438c59b722a21d83597e0,2,voucher,1,7.80
...,...,...,...,...,...
103778,fd86c80924b4be8fb7f58c4ecc680dae,1,credit_card,1,76.10
103817,6d4616de4341417e17978fe57aec1c46,1,credit_card,1,19.18
103860,31bc09fdbd701a7a4f9b55b5955b8687,6,voucher,1,77.99
103869,c9b01bef18eb84888f0fd071b8413b38,1,credit_card,6,238.16
103874,d41f1036712e18ee525939d08b7a1c98,1,credit_card,1,3.57

In [33]:
# Dropping Duplicate Data in Payment data On order_Id as order id should be unique not duplicated

payments_data.drop_duplicates(subset='order_id', keep='first')

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99.33
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24.39
2,25e8ea4e93396b6fa0d3dd708e76c1bd,1,credit_card,1,65.71
3,ba78997921bbcdc1373bb41e913ab953,1,credit_card,8,107.78
4,42fdf880ba16b47b59251dd489d4441a,1,credit_card,2,128.45
...,...,...,...,...,...
103881,0406037ad97740d563a178ecc7a2075c,1,wallet,1,363.31
103882,7b905861d7c825891d6347454ea7863f,1,credit_card,2,96.80
103883,32609bbb3dd69b3c066a6860554a77bf,1,credit_card,1,47.77
103884,b8b61059626efa996a60be9bb9320e10,1,credit_card,5,369.54
103885,28bbae6599b09d39ca406b747b6632b1,1,wallet,1,191.58

In [34]:
# Confirming & Checking Duplicate Data in Payment data using Order Id as Order id should be unique not duplicated

payments_data.drop_duplicates(subset='order_id', keep='first').shape

(99440, 5)

In [35]:
# Final Saving Payment data after dropping duplicate data & checking count

payments_data.drop_duplicates(subset='order_id', keep='first', inplace=True)
payments_data.shape

(99440, 5)

In [36]:
# Checking again for Duplicate Values on order_id

payments_data.order_id.duplicated().sum()

0

###  *products Sheet*

In [37]:
# Reading products Sheet

products_data = pd.read_excel("Retail_dataset.xlsx", sheet_name="products")
products_data.head()

,product_id,product_category_name,product_weight_g,product_length_cm,product_height_cm,product_width_cm
0,1e9e8ef04dbcff4541ed26657ea517e5,perfumery,225.0,16.0,10.0,14.0
1,3aa071139cb16b67ca9e5dea641aaa2f,art,1000.0,30.0,18.0,20.0
2,96bd76ec8810374ed1b65e291975717f,sports_leisure,154.0,18.0,9.0,15.0
3,cef67bcfe19066a932b7673e239eb23d,baby,371.0,26.0,4.0,26.0
4,9dc1a7de274444849c219cff195d0b71,housewares,625.0,20.0,17.0,13.0

In [38]:
# Checking Shape of products Sheet

products_data.shape

(32951, 6)

In [39]:
# Checking info of products Dataset

products_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32951 entries, 0 to 32950
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   product_id             32951 non-null  object
 1   product_category_name  32781 non-null  object
 2   product_weight_g       32949 non-null  float64
 3   product_length_cm      32949 non-null  float64
 4   product_height_cm      32949 non-null  float64
 5   product_width_cm       32949 non-null  float64
dtypes: float64(4), object(2)
memory usage: 1.5+ MB

In [40]:
# Checking Null values in products dataset

products_data.isna().sum().sort_values(ascending=False)

product_category_name    170
product_width_cm           2
product_height_cm          2
product_length_cm          2
product_weight_g           2
product_id                 0
dtype: int64

In [41]:
#Checking occurrence of category in products dataset

products_data.product_category_name.value_counts()

toys                                 24725
bed_bath_table                         789
sports_leisure                         721
furniture_decor                        687
health_beauty                          648
                                     ...
diapers_and_hygiene                      1
fashion_childrens_clothes                1
home_comfort_2                           1
furniture_mattress_and_upholstery        1
security_and_services                    1
Name: product_category_name, Length: 70, dtype: int64

In [42]:
#checking & fetching mode of Category to handle null values
products_data.product_category_name.mode()

0    toys
dtype: object

In [43]:
# Filling Null values of Category with Mode

products_data.product_category_name.fillna(products_data.product_category_name.mode()[0], inplace=True)

In [44]:
# Checking again for Null Values

products_data.isna().sum().sort_values(ascending=False)

product_width_cm         2
product_height_cm        2
product_length_cm        2
product_weight_g         2
product_category_name    0
product_id               0
dtype: int64

In [45]:
# Checking Mean, Mediun of Numeric columns

products_data.describe()

,product_weight_g,product_length_cm,product_height_cm,product_width_cm
count,32949.000000,32949.000000,32949.000000,32949.000000
mean,2276.472488,30.815078,16.937661,23.196728
std,4282.038731,16.914458,13.637554,12.079047
min,0.000000,7.000000,2.000000,6.000000
25%,300.000000,18.000000,8.000000,15.000000
50%,700.000000,25.000000,13.000000,20.000000
75%,1900.000000,38.000000,21.000000,30.000000
max,40425.000000,105.000000,105.000000,118.000000

In [46]:
# Fill Null values of Product_weight_g using median
products_data.product_weight_g.fillna(products_data.product_weight_g.median(), inplace=True)

In [47]:
# Filling Null Values of product_length_cm,product_height_cm,product_width_cm using mean
products_data.product_length_cm.fillna(products_data.product_length_cm.mean(), inplace=True)
products_data.product_height_cm.fillna(products_data.product_height_cm.mean(), inplace=True)
products_data.product_width_cm.fillna(products_data.product_width_cm.mean(), inplace=True)

In [48]:
# Finall Checking again for Null Values

products_data.isna().sum().sort_values(ascending=False)

product_width_cm         0
product_height_cm        0
product_length_cm        0
product_weight_g         0
product_category_name    0
product_id               0
dtype: int64

#### <font color="red">All sheets are cleaned. Saving cleaned sheets in </font> <font color="green">Retail_Dataset_Cleaned.xlsx</font>

In [49]:
# Using Excel writer using XlsxWriter as the engine.
final_sheet = pd.ExcelWriter('Retail_Dataset_Cleaned.xlsx', engine='xlsxwriter')

# Write each cleaned dataframe to a different worksheet.
orders_data.to_excel(final_sheet, sheet_name='orders',index=False)
order_items_data.to_excel(final_sheet, sheet_name='order_items',index=False)
customers_data.to_excel(final_sheet, sheet_name='customers',index=False)
payments_data.to_excel(final_sheet, sheet_name='payments',index=False)
products_data.to_excel(final_sheet, sheet_name='products',index=False)

# Close the Excel writer and output the Excel file.
final_sheet.save()